// 1 . შექმენი ცვლადი age
// თუ age ნაკლებია 13 ზე დააკონსოლე - ბილეთის ფასია 8 ლარი
// თუ მეტია 13 ზე და ნაკლებია 18-ზე - ბილეთის ფასია 12 ლარი
// სხვა შემთხვევაში - ბილეთის ფასია 18 ლარი

let Age = 18

if (Age < 13) {
    console.log('ბილეთის ფასია 8 ლარი');
} else if (Age > 13) {
    console.log('ბილეთის ფასია 12 ლარი');
} else {
    console.log('ბილეთის ფასია 18 ლარი');
}


// 2. შექმენით ცვლადი name და გაუტოლეთ თქვენს სახელს
// კონსოლში კი გამოიტანეთ "Hello სახელი" (სახელის ნაცვლად უნდა იყოს ცვლადი)

let Name = 'vako'
console.log('Hello' + " " + Name);


// 3. შექმენით ცვლადი num
// თუ ცვლადი დადებითია დააკონსოლეთ - "დადებითია"
// თუ ნულის ტოლია - "ნულია"
// თუ უარყოფითია - "უარყოფითია"

let num = 8

if (num > 0) {
    console.log('დადებითია');
} else if (num === 0) {
    console.log('ნულია');
} else {
    console.log('უარყოფითია');
}

// 4. შექმენით ცვლადი weekDay და გაუტოლეთ რომელიმე დღეს.
// თუ weekDay არის სამუშაო დღე მაშინ დააკონსოლეთ - "სამუშაო დღე";
// თუ არა დააკონსოლეთ - "დასვენების დღე"

let weekDay = 'შაბათი'

if (weekDay === 'შაბათი' || weekDay === 'კვირა') {
    console.log('დასვენების დღე');
} else {
    console.log('სამუშაო დღე"');
}

// 5. შექმენით მასივი
// თუ მასივში ელემენტების რაოდენობა მეტია 5 - ზე - დააკონსოლეთ "მეტია ხუთზე"
// თუ ტოლია ხუთის - "ტოლია ხუთის"
// სხვა შემთხვევაში - "ნაკლებია ხუთზე"

let array = [4, 7, 1, 7, 9, 0, 1]

if (array.length > 5) {
    console.log("მეტია ხუთზე")
} else if (array.length == 5) {
    console.log("ტოლია ხუთის")
} else {
    console.log("ნაკლებია ხუთზე")
}

// 6. შექმენით ცვლადი amILazy
// თუ ცვლადი შეშმარიტია დააკონსოლეთ - "ზარმაცი ვარ"
// თუ მცდარია გამოიტანეთ - "არ ვარ ზარმაცი"

amILazy = true

if (amILazy === true) {
    console.log('ზარმაცი ვარ');
} else {
    console.log('არ ვარ ზარმაცი');
}

//7. შექმენით ორი number ტიპის ცვლადი და კონსოლში გამოიტანე
// ამ ორი ციფრის ჯამი გამრავლებული თავის თავზე (ანუ ისევ იგივე ორი ციფრის ჯამზე)
let number1 = 9
let number2 = 8

let plus = number1 + number2
let devide = plus * plus
console.log(devide)
// 8. შექმენი ცვლადი temperature
// თუ ტემპერატურა ნაკლებია 15 - ზე დააკონსოლე "გრილა"
// თუ ტოლია 20 - ის - "თბილა"
// თუ ტოლია 25 - ის - "თითქმის ცხელა"
// თუ ტოლია 30 - ის - "ცხელა"
// თუ მეტია 30- ზე - "ძალიან ცხელა"

let temperature = 23

if (temperature < 15) {
    console.log("გრილა");
} else if (temperature === 20) {
    console.log("თბილა");
} else if (temperature === 25) {
    console.log("თითქმის ცხელა");
} else if (temperature === 30) {
    console.log("ცხელა");
} else if (temperature > 30) {
    console.log("ძალიან ცხელა");
}